#include "sys.h"
#include "sf64audio_provisional.h"


typedef struct SequenceLayer_2 {
    /* 0x00 */ u8 unk0;                             /* inferred */
    /* 0x01 */ u8 unk1;                             /* inferred */
    /* 0x02 */ s8 unk2;                             /* inferred */
    /* 0x03 */ u8 unk3;                             /* inferred */
    /* 0x04 */ u8 unk4;                             /* inferred */
    /* 0x05 */ u8 unk5;                             /* inferred */
    /* 0x06 */ u8 unk6;                             /* inferred */
    /* 0x07 */ char pad7[1];
    /* 0x08 */ u8 unk8;                             /* inferred */
    /* 0x09 */ char pad9[0xF];                      /* maybe part of unk8[0x10]? */
    /* 0x18 */ u8 unk18;                            /* inferred */
    /* 0x19 */ char pad19[3];                       /* maybe part of unk18[4]? */
    /* 0x1C */ EnvelopePoint *unk1C;                /* inferred */
    /* 0x20 */ u16 unk20;                           /* inferred */
    /* 0x22 */ s16 unk22;                           /* inferred */
    /* 0x24 */ f32 unk24;                           /* inferred */
    /* 0x28 */ f32 unk28;                           /* inferred */
    /* 0x2C */ char pad2C[8];                       /* maybe part of unk28[3]? */
    /* 0x34 */ u16 unk34;                           /* inferred */
    /* 0x36 */ u16 unk36;                           /* inferred */
    /* 0x38 */ s16 unk38;                           /* inferred */
    /* 0x3A */ s16 unk3A;                           /* inferred */
    /* 0x3C */ s16 unk3C;                           /* inferred */
    /* 0x3E */ char pad3E[2];
    /* 0x40 */ Note *unk40;                         /* inferred */
    /* 0x44 */ Instrument *unk44;                   /* inferred */
    /* 0x48 */ u32 **unk48;                         /* inferred */
    /* 0x4C */ void *unk4C;                         /* inferred */
    /* 0x50 */ u8 *unk50;                           /* inferred */
    /* 0x54 */ char pad54[0x18];                    /* maybe part of unk50[7]? */
    /* 0x6C */ s32 unk6C;                           /* inferred */
    /* 0x70 */ char pad70[4];
    /* 0x74 */ SequenceLayer_2 *unk74;              /* inferred */
    /* 0x78 */ char pad78[8];                       /* maybe part of unk74[3]? */
} SequenceLayer_2;                                  /* size = 0x80 */


s32 func_80011D10(Instrument *, s32, s32);          /* extern */
? func_80011FA8();                                  /* extern */
? func_800135A8(SequencePlayer *);                  /* extern */
? func_80013A84(Note *);                            /* extern */
SequenceLayer_2 *func_800145FC(AudioListItem *arg0, void *, SequenceLayer_2 *); /* static */
s8 func_800152C0(void *arg0, u8 arg1, Instrument **arg2, u8 *arg3); /* static */
extern AudioListItem D_80151054;
extern ? gBendPitchOneOctaveFrequencies;
extern ? gBendPitchTwoSemitonesFrequencies;
extern EnvelopePoint gDefaultEnvelope;
extern u8 gDefaultShortNoteGateTimeTable;
extern ? gDefaultShortNoteVelocityTable;
extern ? gPitchFrequencies;

void func_80013EA0(SequenceChannel *arg0) {
    SequenceChannel *var_v1;
    s32 var_a0;
    u8 temp_t0;
    u8 temp_t2;
    u8 temp_t4;
