#include "global.h"

typedef struct {
    /* 0x000 */ Object obj;
    /* 0x01C */ ObjectInfo info;
    /* 0x040 */ s32 index;
    /* 0x044 */ char pad44[4];
    /* 0x048 */ s16 unk48;                          /* inferred */
    /* 0x04A */ char pad4A[2];
    /* 0x04C */ s16 unk4C;                          /* inferred */
    /* 0x04E */ s16 unk_04E;
    /* 0x050 */ s16 timer_050;
    /* 0x052 */ s16 timer_052;
    /* 0x054 */ s16 timer_054;
    /* 0x056 */ s16 timer_056;
    /* 0x058 */ s16 timer_058;
    /* 0x05A */ s16 timer_05A;
    /* 0x05C */ s16 timer_05C;
    /* 0x05E */ u8 unk_05E;
    /* 0x05F */ char pad5F[1];
    /* 0x060 */ s16 unk_060;
    /* 0x062 */ s8 unk_062;
    /* 0x063 */ char pad63[1];
    /* 0x064 */ s16 unk_064;
    /* 0x066 */ s16 unk_066;
    /* 0x068 */ f32 unk_068;
    /* 0x06C */ Vec3f vel;
    /* 0x078 */ f32 unk_078;
    /* 0x07C */ f32 unk_07C;
    /* 0x080 */ char pad80[4];
    /* 0x084 */ f32 gravity;
    /* 0x088 */ s16 swork[0x28];
    /* 0x0D8 */ f32 fwork[0x32];
    /* 0x1A0 */ Vec3f vwork[0x32];
    /* 0x3F8 */ f32 unk_3F8;
    /* 0x3FC */ Vec3f sfxPos;
} Boss;                                             /* size = 0x408 */

void func_i3_801A239C(Boss *arg0);              /* static */
void func_i3_801A2C3C(Boss *arg0);              /* static */
void func_i3_801A3468(Boss *arg0);              /* static */
void func_i3_801A48B8(Boss *arg0);              /* static */
void func_i3_801A4EC0(Boss *arg0);              /* static */
void func_i3_801A8DB8(Vec3f *arg0, u32 arg1, f32 arg2); /* static */
extern AnimationHeader D_6009D30;
extern AnimationHeader D_600B1B4;
extern AnimationHeader D_600C15C;
extern AnimationHeader D_600D3DC;
extern AnimationHeader D_600E2C4;
extern Limb *D_600E470;
extern AnimationHeader D_600F744;
extern AnimationHeader D_601388C;
extern ? D_6016CF0;
extern ? D_6017090;
extern ? D_6017370;
extern ? D_601C820;
extern ? D_60231A4;
extern u8 D_801778A3;
static f32 D_i3_801C171C[2] = { 0.1f, 0.1f };   /* const */
static f32 D_i3_801C1728[2] = { M_DTOR, 0.1f }; /* const */
