typedef struct {
    /* 0x000 */ Object obj;
    /* 0x01C */ ObjectInfo info;
    /* 0x040 */ s32 index;
    /* 0x044 */ char pad44[0xA];                    /* maybe part of index[3]? */
    /* 0x04E */ s16 unk_04E;
    /* 0x050 */ s16 timer_050;
    /* 0x052 */ s16 timer_052;
    /* 0x054 */ s16 timer_054;
    /* 0x056 */ s16 timer_056;
    /* 0x058 */ s16 timer_058;
    /* 0x05A */ s16 timer_05A;
    /* 0x05C */ s16 timer_05C;
    /* 0x05E */ u8 unk_05E;
    /* 0x05F */ char pad5F[1];
    /* 0x060 */ s16 unk_060;
    /* 0x062 */ s8 unk_062;
    /* 0x063 */ char pad63[1];
    /* 0x064 */ s16 unk_064;
    /* 0x066 */ s16 unk_066;
    /* 0x068 */ f32 unk_068;
    /* 0x06C */ Vec3f vel;
    /* 0x078 */ char pad78[0xC];
    /* 0x084 */ f32 gravity;
    /* 0x088 */ s16 unk_088;
    /* 0x08A */ s16 unk_08A;
    /* 0x08C */ char pad8C[6];                      /* maybe part of unk_08A[4]? */
    /* 0x092 */ u16 unk_092;
    /* 0x094 */ char pad94[0x12];                   /* maybe part of unk_092[0xA]? */
    /* 0x0A6 */ s16 unk_0A6;
    /* 0x0A8 */ char padA8[6];                      /* maybe part of unk_0A6[4]? */
    /* 0x0AE */ s16 unk_0AE;
    /* 0x0B0 */ char padB0[0xA];                    /* maybe part of unk_0AE[6]? */
    /* 0x0BA */ s16 unkBA;                          /* inferred */
    /* 0x0BC */ char padBC[0xA];                    /* maybe part of unkBA[6]? */
    /* 0x0C6 */ u16 unk_0C6;
    /* 0x0C8 */ char padC8[8];                      /* maybe part of unk_0C6[5]? */
    /* 0x0D0 */ s16 unk_0D0;
    /* 0x0D2 */ char padD2[4];                      /* maybe part of unk_0D0[3]? */
    /* 0x0D6 */ s16 unk_0D6;
    /* 0x0D8 */ char padD8[4];                      /* maybe part of unk_0D6[3]? */
    /* 0x0DC */ f32 unk_0DC;
    /* 0x0E0 */ f32 unk_0E0;
    /* 0x0E4 */ f32 unk_0E4;
    /* 0x0E8 */ f32 unk_0E8;
    /* 0x0EC */ f32 unk_0EC;
    /* 0x0F0 */ f32 unk_0F0;
    /* 0x0F4 */ f32 unk_0F4;
    /* 0x0F8 */ f32 unk_0F8;
    /* 0x0FC */ f32 unk_0FC;
    /* 0x100 */ Vec3f unk_100;
    /* 0x10C */ char pad10C[4];
    /* 0x110 */ f32 unk_110;
    /* 0x114 */ f32 unk_114;
    /* 0x118 */ char pad118[0x7C];                  /* maybe part of unk_114[0x20]? */
    /* 0x194 */ f32 unk_194;
    /* 0x198 */ f32 unk_198;
    /* 0x19C */ f32 unk_19C;
    /* 0x1A0 */ char pad1A0[0x168];                 /* maybe part of unk_19C[0x5B]? */
    /* 0x308 */ Vec3f unk_308;
    /* 0x314 */ char pad314[0xE4];                  /* maybe part of unk_308[0x14]? */
    /* 0x3F8 */ f32 unk_3F8;
    /* 0x3FC */ Vec3f sfxPos;
} Object_408;                                       /* size = 0x408 */

extern ? D_600F1F0;
extern ? D_6011910;
extern ? D_6015EE0;
extern AnimationHeader D_6018994;
extern Limb *D_6018BA0;
extern ? D_601B2B0;
extern ? D_801778F4;
extern s32 D_80177C3C;
extern f32 D_E16C50_801BED74;
extern f32 D_E16C50_801BEE04;
extern f32 D_E16C50_801BEEF4;
extern f32 D_E16C50_801BEF84;
extern f32 D_E16C50_801BF074;
extern f32 D_E16C50_801BF104;
extern ? D_E16C50_801BF194;
f32 D_E16C50_801BECB0[4][3] = {
    { 255.0f, 0.0f, 0.0f },
    { 255.0f, 63.0f, 63.0f },
    { 255.0f, 127.0f, 127.0f },
    { 255.0f, 255.0f, 255.0f },
};
Vec3f D_E16C50_801BECE0 = { 497.0f, 287.0f, 169.0f };
Vec3f D_E16C50_801BECEC = { -497.0f, 287.0f, 169.0f };
Vec3f D_E16C50_801BECF8 = { -6.0f, -528.0f, 169.0f };
Vec3f D_E16C50_801BED04 = { 0.0f, 0.0f, 169.0f };
Vec3f D_E16C50_801BED10 = { 238.0f, 235.0f, 169.0f };
Vec3f D_E16C50_801BED1C = { 238.0f, -235.0f, 169.0f };
