typedef struct {
    /* 0x000 */ Object obj;
    /* 0x01C */ ObjectInfo info;
    /* 0x040 */ s32 index;
    /* 0x044 */ u8 unk_044;
    /* 0x045 */ char pad45[1];
    /* 0x046 */ s16 unk_046;
    /* 0x048 */ s16 unk_048;
    /* 0x04A */ s16 unk_04A;
    /* 0x04C */ s16 timer_04C;
    /* 0x04E */ s16 unk_04E;
    /* 0x050 */ s32 unk_050;
    /* 0x054 */ s32 unk_054;
    /* 0x058 */ s32 unk_058;
    /* 0x05C */ s32 unk_05C;
    /* 0x060 */ s32 unk_060;
    /* 0x064 */ s32 unk_064;
    /* 0x068 */ s32 unk_068;
    /* 0x06C */ s32 unk_06C;
    /* 0x070 */ s32 unk_070;
    /* 0x074 */ s32 unk_074;
    /* 0x078 */ s32 unk_078;
    /* 0x07C */ s32 unk_07C;
    /* 0x080 */ s32 unk_080;
    /* 0x084 */ s32 unk_084;
    /* 0x088 */ s32 unk_088;
    /* 0x08C */ s32 unk_08C;
    /* 0x090 */ s32 unk_090;
    /* 0x094 */ s32 unk_094;
    /* 0x098 */ s32 unk_098;
    /* 0x09C */ s32 unk_09C;
    /* 0x0A0 */ s32 unkA0;                          /* inferred */
    /* 0x0A4 */ char padA4[8];                      /* maybe part of unkA0[3]? */
    /* 0x0AC */ s32 unkAC;                          /* inferred */
    /* 0x0B0 */ s32 unk_0B0;
    /* 0x0B4 */ s16 unk_0B4;
    /* 0x0B6 */ s16 unk_0B6;
    /* 0x0B8 */ s16 unk_0B8;
    /* 0x0BA */ char padBA[2];
    /* 0x0BC */ u16 timer_0BC;
    /* 0x0BE */ u16 timer_0BE;
    /* 0x0C0 */ u16 timer_0C0;
    /* 0x0C2 */ u16 timer_0C2;
    /* 0x0C4 */ u16 timer_0C4;
    /* 0x0C6 */ u16 timer_0C6;
    /* 0x0C8 */ u8 unk_0C8;
    /* 0x0C9 */ u8 unk_0C9;
    /* 0x0CA */ u8 timer_0CA[4];
    /* 0x0CE */ s16 unk_0CE;
    /* 0x0D0 */ s8 unk_0D0;
    /* 0x0D1 */ char padD1[1];
    /* 0x0D2 */ s16 unk_0D2;
    /* 0x0D4 */ s16 unk_0D4;
    /* 0x0D6 */ u16 unk_0D6;
    /* 0x0D8 */ Vec3f unk_0D8;
    /* 0x0E4 */ s16 unk_0E4;
    /* 0x0E6 */ s16 unk_0E6;
    /* 0x0E8 */ Vec3f unk_0E8;
    /* 0x0F4 */ Vec3f unk_0F4;
    /* 0x100 */ Vec3f sfxPos;
    /* 0x10C */ f32 unk_10C;
    /* 0x110 */ f32 scale;
    /* 0x114 */ f32 unk_114;
    /* 0x118 */ f32 unk_118;
    /* 0x11C */ f32 unk_11C;
    /* 0x120 */ f32 unk_120;
    /* 0x124 */ Vec3f unk_124;
    /* 0x130 */ f32 unk_130;
    /* 0x134 */ f32 unk_134;
    /* 0x138 */ f32 unk_138;
    /* 0x13C */ f32 unk_13C;
    /* 0x140 */ f32 unk_140;
    /* 0x144 */ f32 unk_144;
    /* 0x148 */ f32 unk_148;
    /* 0x14C */ f32 unk_14C;
    /* 0x150 */ f32 unk_150;
    /* 0x154 */ f32 unk_154;
    /* 0x158 */ f32 unk_158;
    /* 0x15C */ f32 unk_15C;
    /* 0x160 */ f32 unk_160;
    /* 0x164 */ f32 unk_164;
    /* 0x168 */ f32 unk_168;
    /* 0x16C */ f32 unk_16C;
    /* 0x170 */ f32 unk_170;
    /* 0x174 */ f32 unk_174;
    /* 0x178 */ f32 unk_178;
    /* 0x17C */ f32 unk_17C;
    /* 0x180 */ f32 unk_180;
    /* 0x184 */ f32 unk_184;
    /* 0x188 */ f32 unk_188;
    /* 0x18C */ Vec3f unk_18C[0x1C];
    /* 0x2DC */ Vec3f unk_2DC;
    /* 0x2E8 */ Vec3f unk_2E8;
} Object_2F4;                                       /* size = 0x2F4 */

typedef struct {
    /* 0x000 */ Object obj;
    /* 0x01C */ ObjectInfo info;
    /* 0x040 */ s32 index;
    /* 0x044 */ char pad44[0xA];                    /* maybe part of index[3]? */
    /* 0x04E */ s16 unk_04E;
    /* 0x050 */ s16 timer_050;
    /* 0x052 */ s16 timer_052;
    /* 0x054 */ s16 timer_054;
    /* 0x056 */ s16 timer_056;
    /* 0x058 */ s16 timer_058;
    /* 0x05A */ s16 timer_05A;
    /* 0x05C */ s16 timer_05C;
    /* 0x05E */ u8 unk_05E;
    /* 0x05F */ char pad5F[1];
    /* 0x060 */ s16 unk_060;
    /* 0x062 */ s8 unk_062;
    /* 0x063 */ char pad63[1];
    /* 0x064 */ s16 unk_064;
    /* 0x066 */ s16 unk_066;
    /* 0x068 */ f32 unk_068;
    /* 0x06C */ Vec3f unk_06C;
    /* 0x078 */ char pad78[0xC];
    /* 0x084 */ f32 unk_084;
    /* 0x088 */ s16 unk_088;
    /* 0x08A */ s16 unk_08A;
    /* 0x08C */ char pad8C[6];                      /* maybe part of unk_08A[4]? */
    /* 0x092 */ u16 unk_092;
    /* 0x094 */ char pad94[4];                      /* maybe part of unk_092[3]? */
    /* 0x098 */ s16 unk98;                          /* inferred */
    /* 0x09A */ s16 unk9A;                          /* inferred */
    /* 0x09C */ char pad9C[4];                      /* maybe part of unk9A[3]? */
    /* 0x0A0 */ s16 unkA0;                          /* inferred */
    /* 0x0A2 */ char padA2[2];
    /* 0x0A4 */ s16 unkA4;                          /* inferred */
    /* 0x0A6 */ s16 unk_0A6;
    /* 0x0A8 */ s16 unkA8;                          /* inferred */
    /* 0x0AA */ s16 unkAA;                          /* inferred */
    /* 0x0AC */ char padAC[2];
    /* 0x0AE */ s16 unk_0AE;
    /* 0x0B0 */ char padB0[0x16];                   /* maybe part of unk_0AE[0xC]? */
    /* 0x0C6 */ u16 unk_0C6;
    /* 0x0C8 */ char padC8[8];                      /* maybe part of unk_0C6[5]? */
    /* 0x0D0 */ s16 unk_0D0;
    /* 0x0D2 */ char padD2[4];                      /* maybe part of unk_0D0[3]? */
    /* 0x0D6 */ s16 unk_0D6;
    /* 0x0D8 */ char padD8[4];                      /* maybe part of unk_0D6[3]? */
    /* 0x0DC */ f32 unk_0DC;
    /* 0x0E0 */ f32 unk_0E0;
    /* 0x0E4 */ f32 unk_0E4;
    /* 0x0E8 */ f32 unk_0E8;
    /* 0x0EC */ f32 unk_0EC;
    /* 0x0F0 */ f32 unk_0F0;
    /* 0x0F4 */ f32 unk_0F4;
    /* 0x0F8 */ f32 unk_0F8;
    /* 0x0FC */ f32 unk_0FC;
    /* 0x100 */ Vec3f unk_100;
    /* 0x10C */ char pad10C[4];
    /* 0x110 */ f32 unk_110;
    /* 0x114 */ f32 unk_114;
    /* 0x118 */ char pad118[0x7C];                  /* maybe part of unk_114[0x20]? */
    /* 0x194 */ f32 unk_194;
    /* 0x198 */ f32 unk_198;
    /* 0x19C */ f32 unk_19C;
    /* 0x1A0 */ char pad1A0[0x168];                 /* maybe part of unk_19C[0x5B]? */
    /* 0x308 */ Vec3f unk_308;
    /* 0x314 */ char pad314[0xE4];                  /* maybe part of unk_308[0x14]? */
    /* 0x3F8 */ f32 unk_3F8;
    /* 0x3FC */ Vec3f sfxPos;
} Object_408;                                       /* size = 0x408 */

typedef struct {
    /* 0x000 */ Object obj;
    /* 0x01C */ ObjectInfo info;
    /* 0x040 */ s32 index;
    /* 0x044 */ char pad44[0xA];                    /* maybe part of index[3]? */
    /* 0x04E */ s16 unk_04E;
    /* 0x050 */ s16 timer_050;
    /* 0x052 */ s16 timer_052;
    /* 0x054 */ s16 timer_054;
    /* 0x056 */ s16 timer_056;
    /* 0x058 */ s16 timer_058;
    /* 0x05A */ s16 timer_05A;
    /* 0x05C */ s16 timer_05C;
    /* 0x05E */ u8 unk_05E;
    /* 0x05F */ char pad5F[1];
    /* 0x060 */ s16 unk_060;
    /* 0x062 */ s8 unk_062;
    /* 0x063 */ char pad63[1];
    /* 0x064 */ s16 unk_064;
    /* 0x066 */ s16 unk_066;
    /* 0x068 */ f32 unk_068;
    /* 0x06C */ Vec3f unk_06C;
    /* 0x078 */ char pad78[0xC];
    /* 0x084 */ f32 unk_084;
    /* 0x088 */ s16 unk_088;
    /* 0x08A */ s16 unk_08A;
    /* 0x08C */ s16 unk8C;                          /* inferred */
    /* 0x08E */ s16 unk8E;                          /* inferred */
    /* 0x090 */ s16 unk90;                          /* inferred */
    /* 0x092 */ u16 unk_092;
    /* 0x094 */ s16 unk94;                          /* inferred */
    /* 0x096 */ s16 unk96;                          /* inferred */
    /* 0x098 */ s16 unk98;                          /* inferred */
    /* 0x09A */ s16 unk9A;                          /* inferred */
    /* 0x09C */ s16 unk9C;                          /* inferred */
    /* 0x09E */ s16 unk9E;                          /* inferred */
    /* 0x0A0 */ s16 unkA0;                          /* inferred */
    /* 0x0A2 */ s16 unkA2;                          /* inferred */
    /* 0x0A4 */ s16 unkA4;                          /* inferred */
    /* 0x0A6 */ s16 unk_0A6;
    /* 0x0A8 */ s16 unkA8;                          /* inferred */
    /* 0x0AA */ s16 unkAA;                          /* inferred */
    /* 0x0AC */ s16 unkAC;                          /* inferred */
    /* 0x0AE */ s16 unk_0AE;
    /* 0x0B0 */ s16 unkB0;                          /* inferred */
    /* 0x0B2 */ s16 unkB2;                          /* inferred */
    /* 0x0B4 */ s16 unkB4;                          /* inferred */
    /* 0x0B6 */ char padB6[4];                      /* maybe part of unkB4[3]? */
    /* 0x0BA */ s16 unkBA;                          /* inferred */
    /* 0x0BC */ s16 unkBC;                          /* inferred */
    /* 0x0BE */ char padBE[8];                      /* maybe part of unkBC[5]? */
    /* 0x0C6 */ u16 unk_0C6;
    /* 0x0C8 */ char padC8[8];                      /* maybe part of unk_0C6[5]? */
    /* 0x0D0 */ s16 unk_0D0;
    /* 0x0D2 */ char padD2[4];                      /* maybe part of unk_0D0[3]? */
    /* 0x0D6 */ s16 unk_0D6;
    /* 0x0D8 */ char padD8[4];                      /* maybe part of unk_0D6[3]? */
    /* 0x0DC */ f32 unk_0DC;
    /* 0x0E0 */ f32 unk_0E0;
    /* 0x0E4 */ f32 unk_0E4;
    /* 0x0E8 */ f32 unk_0E8;
    /* 0x0EC */ f32 unk_0EC;
    /* 0x0F0 */ f32 unk_0F0;
    /* 0x0F4 */ f32 unk_0F4;
    /* 0x0F8 */ f32 unk_0F8;
    /* 0x0FC */ f32 unk_0FC;
    /* 0x100 */ Vec3f unk_100;
    /* 0x10C */ char pad10C[4];
    /* 0x110 */ f32 unk_110;
    /* 0x114 */ f32 unk_114;
    /* 0x118 */ char pad118[0x7C];                  /* maybe part of unk_114[0x20]? */
    /* 0x194 */ f32 unk_194;
    /* 0x198 */ f32 unk_198;
    /* 0x19C */ f32 unk_19C;
    /* 0x1A0 */ Vec3f unk1A0;                       /* inferred */
    /* 0x1AC */ char pad1AC[0x15C];                 /* maybe part of unk1A0[0x1E]? */
    /* 0x308 */ Vec3f unk_308;
    /* 0x314 */ char pad314[0xE4];                  /* maybe part of unk_308[0x14]? */
    /* 0x3F8 */ f32 unk_3F8;
    /* 0x3FC */ Vec3f sfxPos;
} Object_408_318;                                   /* size = 0x408 */

struct _struct_D_E16C50_801BFBE0_0x10 {
    /* 0x00 */ f32 unk0;                            /* inferred */
    /* 0x04 */ f32 unk4;                            /* inferred */
    /* 0x08 */ f32 unk8;                            /* inferred */
    /* 0x0C */ char padC[4];
};                                                  /* size = 0x10 */

struct _struct_D_E16C50_801BFC10_0x10 {
    /* 0x00 */ f32 unk0;                            /* inferred */
    /* 0x04 */ f32 unk4;                            /* inferred */
    /* 0x08 */ f32 unk8;                            /* inferred */
    /* 0x0C */ char padC[4];
};                                                  /* size = 0x10 */

struct _struct_D_E16C50_801BFC40_0x10 {
    /* 0x00 */ f32 unk0;                            /* inferred */
    /* 0x04 */ f32 unk4;                            /* inferred */
    /* 0x08 */ f32 unk8;                            /* inferred */
    /* 0x0C */ char padC[4];
};                                                  /* size = 0x10 */

struct _struct_D_E16C50_801BFC94_0xC {
    /* 0x0 */ f32 unk0;                             /* inferred */
    /* 0x4 */ f32 unk4;                             /* inferred */
    /* 0x8 */ f32 unk8;                             /* inferred */
};                                                  /* size = 0xC */

struct _struct_D_E16C50_801BFE18_0xC {
    /* 0x0 */ f32 unk0;                             /* inferred */
    /* 0x4 */ f32 unk4;                             /* inferred */
    /* 0x8 */ f32 unk8;                             /* inferred */
};                                                  /* size = 0xC */

struct _struct_D_E16C50_801BFF38_0xC {
    /* 0x0 */ f32 unk0;                             /* inferred */
    /* 0x4 */ f32 unk4;                             /* inferred */
    /* 0x8 */ f32 unk8;                             /* inferred */
};                                                  /* size = 0xC */

struct _struct_D_E16C50_801C0098_0xC {
    /* 0x0 */ f32 unk0;                             /* inferred */
    /* 0x4 */ f32 unk4;                             /* inferred */
    /* 0x8 */ f32 unk8;                             /* inferred */
};                                                  /* size = 0xC */

struct _struct_D_E16C50_801C0150_0x10 {
    /* 0x00 */ f32 unk0;                            /* inferred */
    /* 0x04 */ f32 unk4;                            /* inferred */
    /* 0x08 */ f32 unk8;                            /* inferred */
    /* 0x0C */ char padC[4];
};                                                  /* size = 0x10 */

? func_80035DEC(f32, f32, f32);                     /* extern */
? func_80036318(PlayerShot *);                      /* extern */
? func_80038140(PlayerShot *);                      /* extern */
? func_8004D440(void *);                            /* extern */
s32 func_80062DBC(Vec3f *, f32 *, Object_80 *, f32, f32, f32); /* extern */
? func_8007CF30(f32, f32, f32, ?);                  /* extern */
? func_800815DC(s16, s32, u16, s16);                /* extern */
? func_80081A8C(f32, f32, f32, f32, s32);           /* extern */
s32 func_80081B24(f32, f32, Vec3f *, f32, f32);     /* extern */
? func_800AC290(PlayerShot *, ?, ?, s32, f32);      /* extern */
extern ? D_3000130;
extern ? D_3000470;
extern ? D_3000AF0;
extern ? D_3000C70;
extern ? D_3006AF0;
extern ? D_3006C70;
extern ? D_3006DE0;
extern AnimationHeader D_6000AE4;
extern Limb *D_6000DB0;
extern AnimationHeader D_6002628;
