typedef struct {
    /* 0x000 */ f32 unk0;                           /* inferred */
    /* 0x004 */ f32 unk_4;
    /* 0x008 */ f32 unk8;                           /* inferred */
    /* 0x00C */ f32 unkC;                           /* inferred */
    /* 0x010 */ f32 unk10;                          /* inferred */
    /* 0x014 */ f32 unk14;                          /* inferred */
    /* 0x018 */ f32 unk18;                          /* inferred */
    /* 0x01C */ f32 unk1C;                          /* inferred */
    /* 0x020 */ f32 unk20;                          /* inferred */
    /* 0x024 */ f32 unk24;                          /* inferred */
    /* 0x028 */ f32 unk28;                          /* inferred */
    /* 0x02C */ f32 unk_2C;
    /* 0x030 */ f32 unk30;                          /* inferred */
    /* 0x034 */ f32 unk34;                          /* inferred */
    /* 0x038 */ f32 unk38;                          /* inferred */
    /* 0x03C */ f32 unk3C;                          /* inferred */
    /* 0x040 */ f32 unk40;                          /* inferred */
    /* 0x044 */ f32 unk44;                          /* inferred */
    /* 0x048 */ f32 unk48;                          /* inferred */
    /* 0x04C */ f32 unk4C;                          /* inferred */
    /* 0x050 */ f32 unk50;                          /* inferred */
    /* 0x054 */ f32 unk54;                          /* inferred */
    /* 0x058 */ char pad58[4];
    /* 0x05C */ f32 unk_5C;
    /* 0x060 */ f32 unk60;                          /* inferred */
    /* 0x064 */ f32 unk_64;
    /* 0x068 */ f32 unk_68;
    /* 0x06C */ f32 unk6C;                          /* inferred */
    /* 0x070 */ f32 unk_70;
    /* 0x074 */ Vec3f unk_74;
    /* 0x080 */ Vec3f unk_80;
    /* 0x08C */ f32 unk8C;                          /* inferred */
    /* 0x090 */ f32 unk90;                          /* inferred */
    /* 0x094 */ Vec3f unk_94;
    /* 0x0A0 */ Vec3f unk_A0;
    /* 0x0AC */ Vec3f unk_AC;
    /* 0x0B8 */ Vec3f unk_B8;
    /* 0x0C4 */ Vec3f unk_C4;
    /* 0x0D0 */ Vec3f unk_D0;
    /* 0x0DC */ Vec3f unk_DC;
    /* 0x0E8 */ char padE8[8];
    /* 0x0F0 */ Vec3f unk_F0;
    /* 0x0FC */ char padFC[8];
    /* 0x104 */ Vec3f unk_104;
    /* 0x110 */ Vec3f unk_110;
    /* 0x11C */ Vec3f unk_11C;
    /* 0x128 */ f32 unk128;                         /* inferred */
    /* 0x12C */ f32 unk12C;                         /* inferred */
    /* 0x130 */ f32 unk130;                         /* inferred */
    /* 0x134 */ f32 unk134;                         /* inferred */
    /* 0x138 */ f32 unk138;                         /* inferred */
    /* 0x13C */ f32 unk13C;                         /* inferred */
    /* 0x140 */ f32 unk140;                         /* inferred */
    /* 0x144 */ f32 unk144;                         /* inferred */
    /* 0x148 */ f32 unk148;                         /* inferred */
    /* 0x14C */ f32 unk14C;                         /* inferred */
    /* 0x150 */ f32 unk150;                         /* inferred */
    /* 0x154 */ f32 unk154;                         /* inferred */
    /* 0x158 */ f32 unk158;                         /* inferred */
    /* 0x15C */ f32 unk15C;                         /* inferred */
    /* 0x160 */ f32 unk160;                         /* inferred */
    /* 0x164 */ char pad164[4];
    /* 0x168 */ f32 unk168;                         /* inferred */
    /* 0x16C */ f32 unk16C;                         /* inferred */
    /* 0x170 */ f32 unk170;                         /* inferred */
    /* 0x174 */ Vec3f unk_174;
    /* 0x180 */ Vec3f unk_180;
    /* 0x18C */ Vec3f unk_18C;
    /* 0x198 */ Vec3f unk_198;
    /* 0x1A4 */ f32 unk1A4;                         /* inferred */
    /* 0x1A8 */ Vec3f unk_1A8;
    /* 0x1B4 */ Vec3f unk_1B4;
    /* 0x1C0 */ f32 unk1C0;                         /* inferred */
    /* 0x1C4 */ f32 unk1C4;                         /* inferred */
    /* 0x1C8 */ f32 unk1C8;                         /* inferred */
    /* 0x1CC */ f32 unk1CC;                         /* inferred */
    /* 0x1D0 */ f32 unk1D0;                         /* inferred */
    /* 0x1D4 */ f32 unk1D4;                         /* inferred */
    /* 0x1D8 */ char pad1D8[0x80];                  /* maybe part of unk1D4[0x21]? */
} UnkStruct_1C24E8;                                 /* size = 0x258 */

extern ? D_E16C50_801C2740;

void func_E16C50_8018FF50(Object_2F4 *obj2F4) {
    f32 temp_ft4;
    f32 temp_fv1;

    obj2F4->obj.rot.y = (Math_Atan2F(gPlayer->camEye.x - obj2F4->obj.pos.x, gPlayer->camEye.z - (obj2F4->obj.pos.z + D_80177D20)) * 180.0f) / M_PI;
    temp_fv1 = gPlayer->camEye.x - obj2F4->obj.pos.x;
    temp_ft4 = gPlayer->camEye.z - (obj2F4->obj.pos.z + D_80177D20);
    obj2F4->obj.rot.x = (-Math_Atan2F(gPlayer->camEye.y - obj2F4->obj.pos.y, sqrtf((temp_fv1 * temp_fv1) + (temp_ft4 * temp_ft4))) * 180.0f) / M_PI;
}

void func_E16C50_80190028(Object_2F4 *obj2F4, Vec3f *pos, Vec3f *rot, f32 xVel, f32 yVel, f32 zVel, s32 arg6, f32 scale, s32 arg8, s32 arg9) {
    Object_2F4_Initialize(obj2F4);
    obj2F4->obj.status = 2;
    obj2F4->obj.id = 0xBD;
    obj2F4->unk_0B8 = (s16) arg6;
    obj2F4->scale = scale;
