#include "global.h"

void func_80047754(Player* player);
void func_80047D38(Player* player, f32);
void func_80047E7C(Player* player, f32, f32);
void func_80047FBC(Player* player);
void func_800481F4(Player* player);
s32 func_80046E40(Player* player, f32* hitboxData, s32* index, f32 xPos, f32 yPos, f32 zPos, f32 xRot, f32 yRot,
                  f32 zRot, f32 arg9, f32 argA, f32 argB);

typedef struct {
    /* 0x00 */ char pad0[0x54];
    /* 0x54 */ f32 unk_54;
    /* 0x58 */ f32 unk_58;
    /* 0x5C */ f32 unk_5C;
    /* 0x60 */ char pad60[0xC];
    /* 0x6C */ f32 unk_6C;
    /* 0x70 */ f32 unk_70;
    /* 0x74 */ f32 unk_74;
} UnkStruct_D_E6A810_801BE250; // probably fake. investigate later.
extern UnkStruct_D_E6A810_801BE250 D_E6A810_801BE250;

static u8 D_800C9F00 = 0;
static u8 D_800C9F04 = 0;
static u8 D_800C9F08 = 0;
static s32 D_800C9F0C = 0; // unused.
static f32 D_800C9F10 = 0.0f;
static s32 D_800C9F14 = 0;
static s32 D_800C9F18[2] = { 0, 0 }; // unused.
static f32 D_800C9F20 = 0.0f;
static f32 D_800C9F24 = 0.0f;
static f32 D_800C9F28 = 0.0f;
Vec3f D_800C9F2C = { 0.0f, 0.0f, 0.0f };
static s32 D_800C9F38 = 0; // unused

extern f32 D_E6A810_801BE258;
extern f32 D_E6A810_801BE25C;
extern f32 D_E6A810_801BE274;
extern f32 D_E6A810_801BE280;
extern f32 D_E6A810_801BE284;
extern f32 D_E6A810_801BE29C;
extern f32 D_E6A810_801BE2A4;
extern s16 D_E6A810_801BE2FA;

void func_80043280(u16* text0, u16* text1, f32 zRot) {
    s32 py;
    s32 px;
    s32 i;
    s32 j;
    f32 dy;
    f32 dx;
    s32 pad;
    Vec3f sp80;
    Vec3f sp74;

    Matrix_Push(&gCalcMatrix);
