#include "global.h"

typedef struct {
    /* 0x00 */ Gfx* unk_00;
    /* 0x04 */ f32* unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ u8 unk_14;
    /* 0x15 */ u8 unk_15;
    /* 0x16 */ u8 unk_16;
    /* 0x17 */ u8 unk_17;
    /* 0x18 */ f32 unk_18;
    /* 0x1C */ u8 unk_1C;
} UnkStruct_D003C; // size = 0x20

extern s32 D_800CFF80[4];
extern s32 D_800CFF90;
extern s16 D_800CFF94[16];
extern u8 D_800CFFB4[16];
extern f32 D_800CFFC4[16];
extern Gfx* D_800D0004[3];
extern Vec3f D_800D0010;
extern f32 D_800D001C[5];
extern Vec3f D_800D0030;
extern UnkStruct_D003C D_800D003C[108];
extern u8 D_800D0DBC[][4]; // could be color struct
extern Vec3f D_800D0DD4[56];
extern Vec3f D_800D1074[24];
extern Vec3f D_800D1194[21];
extern Vec3f D_800D1290;
extern UNK_TYPE D_800D129C[0x8C];
extern Vec3f D_800D14CC;

extern Gfx D_601AD70[];
extern f32 D_6032408[];
extern u16* D_600631C[];
extern u16* D_6009B34[];
extern u16* D_601B1E4[];
extern u16* D_6020DD0[];
extern u16* D_6027F50[];
extern u16* D_60289FC[];
extern u16* D_602AAC0[];
extern u16* D_602F3AC[];
extern u16* D_60308B8[];
extern u16* D_60320D0[];
extern u16* D_6032E18[];
extern u16* D_60381D8[];
extern u16* D_603D9E8[];
extern u16* D_C037E3C[];

extern AnimationHeader D_40001A4;
