#include "sys.h"
#include "sf64audio_external.h"

typedef struct {
    /* 0x00 */ s16 numEntries;
    /* 0x02 */ s16 unkMediumParam;
    /* 0x04 */ u32 romAddr;
    /* 0x08 */ char pad[0x8];
} AudioTableBase;

typedef struct {
    /* 0x00 */ u32 romAddr;
    /* 0x04 */ u32 size;
    /* 0x08 */ s8 medium;
    /* 0x09 */ s8 cachePolicy;
    /* 0x0A */ s16 shortData1;
    /* 0x0C */ s16 shortData2;
    /* 0x0E */ s16 shortData3;
} AudioTableEntry; // size = 0x10

AudioTableBase gSampleBankTableInit = { 4, 0, 0 };
AudioTableEntry gSampleBankTableInitEntries[4] = {
    { 0, 0xE1E30, 2, 4, 0, 0, 0 },
    { 0xE1E30, 0xFF9D0, 2, 4, 0, 0, 0 },
    { 0x1E1800, 0x497480, 2, 4, 0, 0, 0 },
    { 0x678C80, 0xC3900, 2, 4, 0, 0, 0 },
};

AudioTableBase gSeqTableInit = { 66, 0, 0 };
AudioTableEntry gSeqTableInitEntries[66] = {
    { 0x00000, 0x3AF0, 2, 0, 0, 0, 0 },     { 0x03AF0, 0x56B0, 2, 0, 0, 0, 0 },
    { 0x091A0, 0x2D80, 2, 3, 0, 0, 0 },     { 0x0BF20, 0x1410, 2, 3, 0, 0, 0 },
    { 0x0D330, 0x1600, 2, 3, 0, 0, 0 },     { 0x0E930, 0xF20, 2, 3, 0, 0, 0 },
    { 0x0F850, 0x13A0, 2, 3, 0, 0, 0 },     { 0x010BF0, 0x1100, 2, 3, 0, 0, 0 },
    { 0x011CF0, 0x19E0, 2, 3, 0, 0, 0 },    { 0x0136D0, 0x13E0, 2, 3, 0, 0, 0 },
    { 0x014AB0, 0x12F0, 2, 3, 0, 0, 0 },    { SEQ_ID_SECTOR_Y, 0, 2, 3, 0, 0, 0 },
    { 0x15DA0, 0xB70, 2, 3, 0, 0, 0 },      { 0x16910, 0x2460, 2, 3, 0, 0, 0 },
    { 0x18D70, 0xD40, 2, 3, 0, 0, 0 },      { SEQ_ID_FORTUNA, 0, 2, 3, 0, 0, 0 },
    { SEQ_ID_TITANIA, 0, 2, 3, 0, 0, 0 },   { 0x19AB0, 0x7F0, 2, 3, 0, 0, 0 },
    { 0x1A2A0, 0x1440, 2, 3, 0, 0, 0 },     { 0x1B6E0, 0x1B20, 2, 3, 0, 0, 0 },
    { SEQ_ID_BOSS_ME, 0, 2, 3, 0, 0, 0 },   { SEQ_ID_BOSS_CO_1, 0, 2, 3, 0, 0, 0 },
    { SEQ_ID_BOSS_CO_1, 0, 2, 3, 0, 0, 0 }, { SEQ_ID_BOSS_ME, 0, 2, 3, 0, 0, 0 },
    { SEQ_ID_BOSS_ME, 0, 2, 3, 0, 0, 0 },   { 0x1D200, 0x1B30, 2, 3, 0, 0, 0 },
    { SEQ_ID_BOSS_CO_1, 0, 2, 3, 0, 0, 0 }, { SEQ_ID_BOSS_ME, 0, 2, 3, 0, 0, 0 },
    { 0x1ED30, 0x10B0, 2, 3, 0, 0, 0 },     { SEQ_ID_BOSS_BO, 0, 2, 3, 0, 0, 0 },
    { SEQ_ID_BOSS_ME, 0, 2, 3, 0, 0, 0 },   { SEQ_ID_BOSS_BO, 0, 2, 3, 0, 0, 0 },
    { SEQ_ID_BOSS_ME, 0, 2, 3, 0, 0, 0 },   { 0x1FDE0, 0x1410, 2, 3, 0, 0, 0 },
    { 0x211F0, 0xF30, 2, 3, 0, 0, 0 },      { 0x22120, 0x2B30, 2, 3, 0, 0, 0 },
    { 0x24C50, 0x7F0, 2, 3, 0, 0, 0 },      { 0x25440, 0x13B0, 2, 3, 0, 0, 0 },
    { 0x267F0, 0xC70, 2, 3, 0, 0, 0 },      { 0x27460, 0x180, 2, 3, 0, 0, 0 },
    { 0x275E0, 0x5C0, 2, 3, 0, 0, 0 },      { SEQ_ID_TITLE, 0, 2, 3, 0, 0, 0 },
    { 0x27BA0, 0x4E40, 2, 3, 0, 0, 0 },     { 0x2C9E0, 0x14E0, 2, 3, 0, 0, 0 },
    { 0x2DEC0, 0x400, 2, 3, 0, 0, 0 },      { 0x2E2C0, 0x800, 2, 3, 0, 0, 0 },
    { 0x2EAC0, 0x1AB0, 2, 3, 0, 0, 0 },     { 0x30570, 0x1AA0, 2, 3, 0, 0, 0 },
    { SEQ_ID_BOSS_ME, 0, 2, 3, 0, 0, 0 },   { 0x32010, 0x1370, 2, 3, 0, 0, 0 },
    { 0x33380, 0xB80, 2, 3, 0, 0, 0 },      { 0x33F00, 0x5C0, 2, 3, 0, 0, 0 },
    { SEQ_ID_CO_INTRO, 0, 2, 3, 0, 0, 0 },  { SEQ_ID_CO_INTRO, 0, 2, 3, 0, 0, 0 },
    { 0x344C0, 0x550, 2, 3, 0, 0, 0 },      { 0x34A10, 0x360, 2, 3, 0, 0, 0 },
    { 0x34D70, 0x620, 2, 3, 0, 0, 0 },      { SEQ_ID_VS_MENU, 0, 2, 3, 0, 0, 0 },
    { 0x35390, 0xA70, 2, 3, 0, 0, 0 },      { SEQ_ID_STAR_WOLF, 0, 2, 3, 0, 0, 0 },
    { 0x35E00, 0xAB0, 2, 3, 0, 0, 0 },      { 0x368B0, 0x13D0, 2, 3, 0, 0, 0 },
    { 0x37C80, 0x250, 2, 3, 0, 0, 0 },      { 0x37ED0, 0x6F0, 2, 3, 0, 0, 0 },
    { 0x385C0, 0xFB0, 2, 3, 0, 0, 0 },      { 0x39570, 0x1780, 2, 3, 0, 0, 0 },
};
AudioTableBase gSoundFontTableInit = { 33, 0, 0 };
AudioTableEntry gSoundFontTableInitEntries[33] = {
    { 0, 0x2F00, 2, 0, 0xFF, 0x7F00, 0 },        { 0x2F00, 0xFE0, 2, 0, 0x1FF, 0x7F00, 0 },
    { 0x3EE0, 0x640, 2, 0, 0x2FF, 0x7F00, 0 },   { 0x4520, 0x1560, 2, 0, 0x2FF, 0x7F00, 0 },
    { 0x5A80, 0xC00, 2, 0, 0x2FF, 0x7F00, 0 },   { 0x6680, 0xDE0, 2, 0, 0x2FF, 0x7F00, 0 },
    { 0x7460, 0x1200, 2, 0, 0x2FF, 0x7F00, 0 },  { 0x8660, 0x1040, 2, 0, 0x2FF, 0x7F00, 0 },
    { 0x96A0, 0xE40, 2, 0, 0x2FF, 0x7F00, 0 },   { 0xA4E0, 0xC20, 2, 0, 0x2FF, 0x7F00, 0 },
    { 0xB100, 0x1920, 2, 0, 0x2FF, 0x7F00, 0 },  { 0xCA20, 0xA20, 2, 0, 0x2FF, 0x7F00, 0 },
    { 0xD440, 0xA00, 2, 0, 0x2FF, 0x7F00, 0 },   { 0xDE40, 0xD60, 2, 0, 0x2FF, 0x7F00, 0 },
    { 0xEBA0, 0xC20, 2, 0, 0x2FF, 0x7F00, 0 },   { 0xF7C0, 0xF00, 2, 0, 0x2FF, 0x7F00, 0 },
    { 0x106C0, 0xF20, 2, 0, 0x2FF, 0x7F00, 0 },  { 0x115E0, 0xE20, 2, 0, 0x2FF, 0x7F00, 0 },
    { 0x12400, 0x10A0, 2, 0, 0x2FF, 0x7F00, 0 }, { 0x134A0, 0x2580, 2, 0, 0x2FF, 0x7F00, 0 },
    { 0x15A20, 0x9E0, 2, 0, 0x2FF, 0x7F00, 0 },  { 0x16400, 0x1220, 2, 3, 0x3FF, 0x1040, 0 },
    { 0x17620, 0x180, 2, 3, 0x3FF, 0x300, 0 },   { 0x177A0, 0x11C0, 2, 3, 0x3FF, 0x1040, 0 },
    { 0x18960, 0x940, 2, 3, 0x3FF, 0xA40, 0 },   { 0x192A0, 0x9E0, 2, 3, 0x3FF, 0xA40, 0 },
    { 0x19C80, 0x920, 2, 3, 0x3FF, 0xA40, 0 },   { 0x1A5A0, 0x9E0, 2, 3, 0x3FF, 0xA40, 0 },
    { 0x1AF80, 0x9E0, 2, 3, 0x3FF, 0xA40, 0 },   { 0x1B960, 0xA10, 2, 3, 0x3FF, 0xA40, 0 },
    { 0x1C370, 0x9E0, 2, 3, 0x3FF, 0xA40, 0 },   { 0x1CD50, 0xA00, 2, 3, 0x3FF, 0xA40, 0 },
    { 0x1D750, 0x8D0, 2, 3, 0x3FF, 0xA40, 0 },
};

u8 gSeqFontTableInit[288] = {
    0,  132, 0,  134, 0,  155, 0,  157, 0,  159, 0,  161, 0,  163, 0,  165, 0,  167, 0,  169, 0,  171, 0,  173,
    0,  175, 0,  177, 0,  179, 0,  181, 0,  183, 0,  185, 0,  187, 0,  189, 0,  191, 0,  193, 0,  195, 0,  197,
    0,  199, 0,  201, 0,  203, 0,  205, 0,  207, 0,  209, 0,  211, 0,  213, 0,  215, 0,  217, 0,  219, 0,  221,
    0,  223, 0,  225, 0,  227, 0,  229, 0,  231, 0,  233, 0,  235, 0,  237, 0,  239, 0,  241, 0,  243, 0,  245,
    0,  247, 0,  249, 0,  251, 0,  253, 0,  255, 1,  1,   1,  3,   1,  5,   1,  7,   1,  9,   1,  11,  1,  13,
    1,  15,  1,  17,  1,  19,  1,  21,  1,  23,  1,  25,  1,  0,   20, 20,  19, 18,  17, 16,  15, 14,  13, 12,
    11, 10,  9,  8,   7,  6,   5,  4,   3,  1,   2,  1,   24, 1,   29, 1,   25, 1,   26, 1,   28, 1,   25, 1,
    25, 1,   29, 1,   24, 1,   29, 1,   28, 1,   25, 1,   30, 1,   24, 1,   25, 1,   28, 1,   28, 1,   31, 1,
    31, 1,   28, 1,   28, 1,   31, 1,   31, 1,   31, 1,   28, 1,   31, 1,   31, 1,   31, 1,   31, 1,   31, 1,
    31, 1,   32, 1,   21, 1,   21, 1,   22, 1,   21, 1,   21, 1,   21, 1,   21, 1,   21, 1,   23, 1,   25, 1,
    21, 1,   21, 1,   29, 1,   25, 1,   31, 1,   21, 1,   21, 1,   21, 1,   21, 1,   21, 1,   21, 1,   21, 1,
    21, 1,   21, 1,   27, 1,   25, 1,   21, 1,   25, 1,   25, 1,   25, 1,   21, 1,   31, 0,   0,  0,   0,  0,
};
