/*
 * File: fox_ma.c
 * System: Macbeth
 * Description: Level: Macbeth
 */

// #include "prevent_bss_reordering.h"
#include "global.h"
#include "assets/ast_macbeth.h"
#include "assets/ast_landmaster.h"
#include "assets/ast_enmy_planet.h"
// #include "prevent_bss_reordering2.h"

typedef struct {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ s16 unk_10;
} UnkStruct_D_i5_801B8E50; // size = 0x14

typedef struct {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ s16 unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ s16 unk_10;
} UnkStruct_D_i5_801BA1EC; // size = 0x14

void Macbeth_801AD624(f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, f32, s16, s16, f32);
bool Macbeth_801A0308(Actor*, f32, f32, u8);
void Macbeth_801AF200(f32, f32, f32, f32, f32, f32);
void Macbeth_801A015C(Actor*);
void Macbeth_8019D048(Actor*);
void Macbeth_8019FC54(Actor*, s32*, s32*, s32, s32, f32, f32, s32*);
void Macbeth_8019D670(f32, f32, f32, f32, f32, f32, f32, s32, u8);
void Macbeth_8019D910(Actor*, s32*, s32*, s32, f32, f32, s32*, s32*);
bool Macbeth_801AC5AC(s32, Gfx**, Vec3f*, Vec3f*, void*);
void Macbeth_801A49B8(Actor*);
void Macbeth_801ADCEC(f32, f32, f32, f32, f32, f32);
void Macbeth_801AE610(f32, f32, f32, f32, f32, f32, s16);
void Macbeth_801AE800(f32, f32, f32, f32, f32, f32);
void Macbeth_801ACF6C(void);

f32 D_MA_801BE250[40];
s16 D_MA_801BE2F0[9];
// #include "prevent_bss_reordering.h"
char D_i5_801BE308[8];
s16 D_i5_801BE310;
u8 D_i5_801BE312;
u8 D_i5_801BE313;
s16 D_i5_801BE314;
