#ifndef STRUCTS_H
#define STRUCTS_H

#include "global.h"
#include "sf64math.h"

typedef struct UnkStruct_D_801B8350 {
    /* 0x00 */ Vec3f unk0;
    /* 0x0C */ char pad_0C[0x4C];
    /* 0x54 */ s32 unk54;
    /* 0x58 */ s32 unk58;
} UnkStruct_D_801B8350;

typedef struct UnkStruct_D_80178280 {
    /* 0x000 */ char pad_0[0x07C];
    /* 0x07C */ f32 unk07C;
    /* 0x080 */ char pad_80[0x148];
    /* 0x1C8 */ s32 unk1C8;
    /* 0x1CC */ char pad_1CC[0x44];
    /* 0x210 */ s32 unk210;
    /* 0x214 */ char pad_214[0x14];
    /* 0x228 */ s32 unk228;
    /* 0x22C */ char pad_22C[0x38];
    /* 0x264 */ s32 unk264;
    /* 0x268 */ char pad_268[0x4];
    /* 0x26C */ s32 unk26C;
    /* 0x270 */ char pad_270[0x44];
    /* 0x2B4 */ s32 unk2B4;
    /* 0x2B8 */ char pad_2B8[0x4];
    /* 0x2BC */ f32 unk2BC;
    /* 0x2C0 */ char pad_2C0[0x220];
} UnkStruct_D_80178280; // size = 0x4E0

#endif
