#include "global.h"
#include "assets/ast_title.h"
#include "assets/ast_ending_award_front.h"
#include "assets/ast_ending_award_back.h"
#include "assets/ast_allies.h"
#include "assets/ast_great_fox.h"
#include "assets/ast_ending.h"
#include "prevent_bss_reordering.h"

void Ending_8018CE20(s32);
void Ending_801926D4(void);
extern u32 D_ending_80192E70;

bool Ending_80189C64(s32 limbIndex, Gfx** dList, Vec3f* pos, Vec3f* rot, void* data);
void Ending_8018ABE8(void);
void Ending_8018B3D8(void);
bool Ending_8018BCB0(void);
void Ending_8018C21C(void);

typedef struct {
    /* 0x00 */ Animation* anim;
    /* 0x04 */ Limb** skeleton;
    /* 0x08 */ s16 setupDL;
    /* 0x0C */ Vec3f pos;
    /* 0x18 */ Vec3f rot;
    /* 0x24 */ Vec3f scale;
    /* 0x30 */ f32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ Color_RGBA32 prim;
} UnkStruct_196D08; // size = 0x40

s32 D_ending_80196D00;
s32 D_ending_80196D04;
UnkStruct_196D08 D_ending_80196D08[10];
s32 D_ending_80196F88;
u32 D_ending_80196F8C;
s32 D_ending_80196F90;
s32 D_ending_80196F94;
s32 D_ending_80196F98;
f32 D_ending_80196F9C;
Vec3f D_ending_80196FA0[4][50];
Vec3f D_ending_80197900[4][50];
s32 D_ending_80198260[4][50];
f32 D_ending_80198580;
bool D_ending_80198584;
s32 D_ending_80198588;
s32 D_ending_8019858C;

const char str1[] = "fogR= %d, fogG= %d, fogB= %d\n";
const char str2[] = "ligR= %d, ligG= %d, ligB= %d\n";
const char str3[] = "kanR= %d, kanG= %d, kanB= %d\n";
const char str4[] = "ligX= %f, ligY= %f, ligZ= %f\n";
const char str5[] = "ligXp=%d, ligYp=%d, ligZp=%d\n\n";
const char str6[] = "fogS1= %d, fogS2= %d\n";
const char str7[] = "eyeX= %f, eyeY= %f, eyeZ= %f\n";
const char str8[] = "wayX= %f, wayY= %f, wayZ= %f\n";
const char str9[] = "[G-Fox-> %d]\n";
const char str10[] = "xp= %f, yp= %f, zp= %f\n";
