#ifndef FOX_END2_DATA
#define FOX_END2_DATA

#include "global.h"
#include "assets/ast_arwing.h"
#include "assets/ast_text.h"
#include "assets/ast_title.h"
#include "assets/ast_ending.h"

typedef struct {
    /* 0x00 */ u8* unk_00;
    /* 0x04 */ u32 unk_04;
    /* 0x08 */ u32 unk_08;
    /* 0x0C */ u16 unk_0C;
    /* 0x0E */ u16 unk_0E;
    /* 0x10 */ u8 unk_10;
    /* 0x11 */ u8 unk_11;
    /* 0x12 */ u8 unk_12;
    /* 0x13 */ u8 unk_13;
} Credit; // size = 0x14

typedef struct {
    /* 0x00 */ u32 unk_00;
    /* 0x04 */ u32 unk_04;
    /* 0x08 */ u8 unk_08;
    /* 0x0C */ Vec3f unk_0C;
    /* 0x18 */ Vec3f unk_18;
    /* 0x24 */ Vec3f unk_24;
    /* 0x30 */ Vec3f unk_30;
    /* 0x3C */ Vec3f unk_3C;
    /* 0x48 */ Vec3f unk_48;
} UnkEnd54; // size = 0x54

typedef struct AssetInfo {
    /* 0x00 */ void* unk_00;
    /* 0x04 */ void* unk_04;
    /* 0x08 */ s16 unk_08;
    /* 0x0C */ u32 unk_0C;
    /* 0x10 */ u32 unk_10;
    /* 0x14 */ f32 unk_14;
    /* 0x18 */ Vec3f unk_18;
    /* 0x24 */ Vec3f unk_24;
    /* 0x30 */ Vec3f unk_30;
    /* 0x3C */ Vec3f unk_3C;
    /* 0x48 */ Vec3f unk_48;
    /* 0x54 */ Vec3f unk_54;
    /* 0x60 */ Color_RGBA32 fog;
    /* 0x64 */ s16 fogNear;
    /* 0x66 */ s16 fogFar;
    /* 0x68 */ Color_RGBA32 env;
    /* 0x6C */ Color_RGBA32 prim;
    /* 0x70 */ u8 unk_70;
    /* 0x71 */ u8 unk_71;
} AssetInfo; // size = 0x72

void Ending_8018D250(u32 arg0, AssetInfo* asset);
void Ending_8018D28C(s32 arg0, AssetInfo* asset);
void Ending_8018D2C8(u32 arg0, AssetInfo* asset);
void Ending_8018D398(u32 arg0, AssetInfo* asset);
void Ending_8018D4BC(s32 arg0, AssetInfo* asset);
void Ending_8018D638(u32 arg0, AssetInfo* asset);
void Ending_8018D814(u32 arg0, AssetInfo* asset);
void Ending_8018DA0C(u32 arg0, AssetInfo* asset);
bool Ending_8018DCB4(void);
void Ending_8018E1B8(u32 arg0, AssetInfo* asset);
void Ending_8018E7B8(u32 arg0, AssetInfo* asset);
void Ending_8018EDB8(u32 arg0, AssetInfo* asset);
void Ending_8018F2A8(u32 arg0, AssetInfo* asset);
void Ending_8018F64C(u32 arg0, AssetInfo* asset);
void Ending_8018FC60(u32 arg0, AssetInfo* asset);
void Ending_80190274(u32 arg0, AssetInfo* asset);
void Ending_80190648(s32 arg0, AssetInfo* asset);
void Ending_80190778(u32 arg0, AssetInfo* asset);
void Ending_80190CF0(u32 arg0, AssetInfo* asset);
