#include "global.h"

typedef struct {
    /* 0x00 */ u8* unk_00;
    /* 0x04 */ u32 unk_04;
    /* 0x08 */ u32 unk_08;
    /* 0x0C */ u16 unk_0C;
    /* 0x0E */ u16 unk_0E;
    /* 0x10 */ u8 unk_10;
    /* 0x11 */ u8 unk_11;
    /* 0x12 */ u8 unk_12;
    /* 0x13 */ u8 unk_13;
} UnkStruct_D_ending_80192E74; // size = 0x14

typedef struct AssetInfo {
    /* 0x00 */ void* unk_00; // pointer to a display list ?
    /* 0x04 */ void* unk_04;
    /* 0x08 */ s16 unk_08;
    /* 0x0C */ u32 unk_0C;
    /* 0x10 */ u32 unk_10;
    /* 0x14 */ f32 unk_14;
    /* 0x18 */ Vec3f unk_18;
    /* 0x24 */ Vec3f unk_24;
    /* 0x30 */ Vec3f unk_30;
    /* 0x3C */ Vec3f unk_3C;
    /* 0x48 */ Vec3f unk_48;
    /* 0x54 */ Vec3f unk_54;
    /* 0x60 */ u8 fogRed;
    /* 0x61 */ u8 fogGreen;
    /* 0x62 */ u8 fogBlue;
    /* 0x64 */ s16 fogNear;
    /* 0x66 */ s16 fogFar;
    /* 0x68 */ u8 envRed;
    /* 0x69 */ u8 envGreen;
    /* 0x6A */ u8 envBlue;
    /* 0x6B */ u8 envAlpha;
    /* 0x6C */ u8 primRed;
    /* 0x6D */ u8 primGreen;
    /* 0x6E */ u8 primBlue;
    /* 0x6F */ u8 primAlpha;
    /* 0x70 */ u8 unk_70;
    /* 0x71 */ u8 unk_71;
} AssetInfo; // size = 0x72

extern u16 D_8025080[];

extern s32 D_ending_80192E70;
extern UnkStruct_D_ending_80192E74 D_ending_80192E74[80];
extern AssetInfo D_ending_801934B4[];
extern WingInfo D_ending_80198590;
extern Vec3f D_ending_801985D0;
extern Vec3f D_ending_801985F0;
extern Vec3f D_ending_80198600[300];

extern u8 D_5007240[];
extern u8 D_5007330[];
extern u8 D_5007420[];
extern Gfx D_7002120[];
extern Gfx D_7004240[];
extern Gfx D_700E9E0[];
extern u16 D_700EA38[];
extern Gfx D_7010970[];
extern u16 D_8000000[];

bool func_ending_8018DCB4();

void func_ending_8018CE20(u32 arg0) {
    u8 alpha;
    s32 i;
    s32 xPos;

    for (i = 0; i < ARRAY_COUNT(D_ending_80192E74); i++) {
        if (D_ending_80192E74[i].unk_00 != NULL) {
            if ((D_ending_80192E74[i].unk_04 <= arg0) &&
                ((D_ending_80192E74[i].unk_04 + D_ending_80192E74[i].unk_08) > arg0)) {
                alpha = 255;

