#include "global.h"

extern Limb* D_900D164[];
extern Limb* D_901C0F4[];
extern Animation D_900D098;
extern Gfx D_900DF20[];
extern Animation D_9018BD0;
extern Animation D_901A4B8;
extern Animation D_901BDA8;
extern Animation D_901DA38;
extern Animation D_9024738;
extern Animation D_9024738;
extern Animation D_9010FC4;
extern Gfx D_9000000[];
extern Gfx D_90007F0[];
extern Gfx D_9013880[];
extern Gfx D_9014DF0[];
extern Gfx D_90150A0[];
extern Gfx D_9015480[];
extern Gfx D_9015900[];
extern Gfx D_9015BB0[];
extern Gfx D_901E350[];
extern Gfx D_901F6D0[];
extern Gfx D_901F990[];
extern Gfx D_901FC40[];
extern Gfx D_9021630[];
extern Gfx D_9021900[];
extern Gfx D_9021B80[];
extern Gfx D_9022A20[];
extern Gfx D_9022D80[];
extern Gfx D_9024750[];

typedef struct {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
    /* 0x0C */ s16 unk_0C;
    /* 0x0E */ s16 unk_0E[4];
    /* 0x16 */ s16 unk_16;
} UnkStruct_i1_8019A820; // size = 0x18

typedef struct {
    /* 0x00 */ s16 unk_00;
    /* 0x0A */ s16 unk_02[5];
    /* 0x0C */ Vec3f unk_0C[3];
    /* 0x30 */ Vec3f unk_30[3];
    /* 0x3C */ char pad54[0xC]; // Vec3f?
    /* 0x60 */ f32 unk_60;
    /* 0x64 */ f32 unk_64;
    /* 0x68 */ f32 unk_68;
    /* 0x6C */ f32 unk_6C;
    /* 0x70 */ f32 unk_70;
    /* 0x74 */ f32 unk_74;
    /* 0x78 */ f32 unk_78;
    /* 0x7C */ u16 unk_7C;
} UnkStruct_i1_8019B838; // size = 0x80

typedef struct {
    /* 0x0 */ f32 unk_0;
    /* 0x4 */ s16 unk_4;
    /* 0x6 */ s16 unk_6;
} UnkStruct_i1_8019AE00; // size = 0x8

typedef struct {
    /* 0x0 */ s16 unk_0;
    /* 0x2 */ u8 unk_2;
} UnkStruct_i1_8019ACF8; // size = 0x4

typedef struct {
    /* 0x0 */ s16 limb;
    /* 0x4 */ Gfx* dList;
    /* 0x8 */ s16 index;
    /* 0xA */ s16 flag;
} UnkStruct_i1_8019A748; // size = 0xC

typedef struct {
    /* 0x0 */ Vec3f offset;
    /* 0xC */ f32 size;
} UnkStruct_i1_8019A058; // size = 0x10

typedef struct {
    /* 0x0 */ UnkStruct_i1_8019ACF8* unk_0;
    /* 0x4 */ s32 unk_4;
} UnkStruct_i1_8019AD2C; // size = 0x8

typedef struct {
    /* 0x0 */ f32 x;
    /* 0x4 */ f32 y;
    /* 0x8 */ f32 z;
    /* 0xC */ f32 unk_C;
} UnkStruct_i1_80199B40; // size = 0x10

UnkStruct_i1_80199B40 D_i1_80199B40[5][5] = {
    {
        { 500.0f, 424.0f, 334.0f, 0.0f },
        { 500.0f, 112.0f, 328.0f, 0.0f },
        { 787.0f, 600.0f, -29.0f, 0.0f },
        { 800.0f, 291.0f, -298.0f, 0.0f },
        { 800.0f, 724.0f, -500.0f, 0.0f },
    },
    {
        { 500.0f, 501.0f, 267.0f, 0.0f },
        { 770.0f, 182.0f, -80.0f, 0.0f },
        { 500.0f, 710.0f, -497.0f, 0.0f },
        { 800.0f, 90.0f, -625.0f, 0.0f },
        { 800.0f, 422.0f, -1100.0f, 0.0f },
    },
    {
        { 500.0f, 424.0f, 334.0f, 0.0f },
        { 500.0f, 112.0f, 328.0f, 0.0f },
        { 787.0f, 600.0f, -29.0f, 0.0f },
        { 800.0f, 291.0f, -298.0f, 0.0f },
        { 800.0f, 724.0f, -500.0f, 0.0f },
    },
    {
        { 500.0f, 501.0f, 267.0f, 0.0f },
        { 770.0f, 182.0f, -80.0f, 0.0f },
        { 500.0f, 710.0f, -497.0f, 0.0f },
        { 800.0f, 90.0f, -625.0f, 0.0f },
